---
kind: other
id: Methods.T:Autodesk.Revit.DB.DocumentVersion
source: html/ef754f7d-85e8-e565-a50e-da2a4e5e153a.htm
---
# DocumentVersion Methods

Checks whether two DocumentVersions are identical.
 They are identical if both the GUID and number of saves
 are equal. If two DocumentVersions are identical, they
 come from the same document, with the same set of changes.